///////////////////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции общего назначения, значения которых кэшируются на время сеанса

#Область ПрограммныйИнтерфейс

// Функция - Получить ссылку по предопределенному объекту
//
// Параметры:
//  ПредопределенноеЗначениеОбъекта	 - 	СправочникСсылка.ЕАЕ_ПредопределенныеЗначенияОбъектов - ссылка на предопределенный элемент справочника (для отбора)
// 
// Возвращаемое значение:
//   ЛюбаяСсылка,  Неопределено - ссылка на искомые элементы любого типа, удовлетворяющее условиям отбора
//
Функция ПолучитьСсылкуПоПредопределенномуОбъекту(ПредопределенноеЗначениеОбъекта) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ЕАЕ_ОбщегоНазначенияСервер.ПолучитьСсылкуПоПредопределенномуОбъекту(ПредопределенноеЗначениеОбъекта);

КонецФункции

#КонецОбласти