////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции общего назначения

#Область ПрограммныйИнтерфейс

// Функция - Получить ссылку по предопределенному объекту
//
// Параметры:
//  ПредопределенноеЗначениеОбъекта	 - 	СправочникСсылка.ЕАЕ_ПредопределенныеЗначенияОбъектов - ссылка на предопределенный элемент справочника (для отбора)
// 
// Возвращаемое значение:
//   ЛюбаяСсылка,  Неопределено - ссылка на искомые элементы любого типа, удовлетворяющее условиям отбора
//
Функция ПолучитьСсылкуПоПредопределенномуОбъекту(ПредопределенноеЗначениеОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕАЕ_СоответствиеПредопредОбъектовЗначениямОбъектовБД.Значение
	               |ИЗ
	               |	РегистрСведений.ЕАЕ_СоответствиеПредопредОбъектовЗначениямОбъектовБД КАК ЕАЕ_СоответствиеПредопредОбъектовЗначениямОбъектовБД
	               |ГДЕ
	               |	ЕАЕ_СоответствиеПредопредОбъектовЗначениямОбъектовБД.ПредопределенныйОбъект = &ПредопределенныйОбъект";
	
	Запрос.УстановитьПараметр("ПредопределенныйОбъект", ПредопределенноеЗначениеОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Значение;
			
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти